result_not_consolidated/4core_4iothread/c8220(ivy)_not_consolidated_4core_4iothread/default/run4.txt
# run=4/5
# 2026-04-08T21:25:43-06:00

# cmd: taskset -c 5-39 ./bin/sysbench ./share/sysbench/oltp_read_write.lua
           --mysql-host=localhost
           --mysql-port=3306
           --mysql-user=sbuser
           --mysql-password=password
           --mysql-db=sbtest
           --tables=1
           --table_size=100
           --threads=16
           --time=60
           --rand-type=pareto
           --histogram=off
           run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            421806
        write:                           114108
        other:                           57915
        total:                           593829
    transactions:                        27786  (462.49 per sec.)
    queries:                             593829 (9884.19 per sec.)
    ignored errors:                      2343   (39.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      462.4937
    time elapsed:                        60.0787s
    total number of events:              27786

Latency (ms):
         min:                                    3.27
         avg:                                   34.57
         max:                                  827.70
         95th percentile:                      142.39
         sum:                               960658.11

Threads fairness:
    events (avg/stddev):           1736.6250/16.90
    execution time (avg/stddev):   60.0411/0.02